<template><div><h1 id="_2019秋招总结" tabindex="-1"><a class="header-anchor" href="#_2019秋招总结" aria-hidden="true">#</a> 2019秋招总结</h1>
<blockquote>
<p>激情过后，总要回归平静的生活</p>
</blockquote>
<p><img src="@source/blog/common/1.gif" alt=""></p>
<h2 id="_01-前言" tabindex="-1"><a class="header-anchor" href="#_01-前言" aria-hidden="true">#</a> 01 前言</h2>
<p>一般今天的秋招从7月就已经开始了，由于我在广州这边实习，加上公司比较忙，业务也是一些零散的东西，花时间也比较多，基本上没有时间找工作。这段时间一直持续到9月，很不巧的是9月到10月这段时间需要参加学校安排的生产实习的课程，也是在广州这边。</p>
<p>培训期间请假不能太频繁，那段时间接受到了很多的线下面试的公司，都给搁了，今年就是很多公司都喜欢线下面试，喜欢看你手写代码但你又写不出的尴尬，哈哈哈~~~</p>
<p>10月放完国庆就回到学校继续大四（咸鱼）拼搏的生活了，这时候已经意识到很多公司，特别是互联网大厂基本已经内推结束了，我那时候说不慌是假的，难道只能等春招？肯定不是的，况且春招的岗位也是比较少，竞争也激烈不少，只能冲一下秋招。</p>
<p>所以我就每天都留意牛客网上面的内推直捞或者补录的信息，基本上拿到offer之前都天天看，生怕错过什么信息。看到最多的就是字节跳动的招聘，虽然说是很缺人，投了简历却没有消息，怀疑人生...难道简历写得不好还是卡我学校哈哈哈，都不得而知。那段时间都是看到内推岗位就投了。</p>
<p><img src="@source/blog/2019-summarize/img/1.png" alt=""></p>
<h2 id="_02-面试" tabindex="-1"><a class="header-anchor" href="#_02-面试" aria-hidden="true">#</a> 02 面试</h2>
<p>个人的刚起步的时候基础都不怎么好，所以面试的公司都大部分挂掉了。。。</p>
<p>深信服：在9月的时候收到了深信服的广工场面试，上面就是手撕代码，blabla几个题，结果一下子把我送回了家。所以必须要熟悉手写的面试题目，比如promise异步，原型链继承等。</p>
<p>阿里：大概11月份的时候，突然接到阿里的面试，开始直接就问我项目，问完之后就开始发链接过来手撕代码了，30多分钟面试，现在也没消息</p>
<p>字节跳动：也是面完阿里的隔天，字节约面试了，先是20分钟左右的前端基础知识，后面30多分钟也开始了手撕代码之旅，50分钟的面试让我头皮发麻，效率还挺高，隔天感谢信就送到。</p>
<p>腾讯：错过之前的内推，遇到上要笔试的环节，我是腾讯第三轮的笔试，一上来就5道编程题，我懵了，直接结束笔试盖上电脑</p>
<p>美团：投了，基本上一直在初筛</p>
<p>SHEIN：初筛过后，暂不匹配</p>
<p>CVTE：这个面试好像是11月末的时候，晚上聊了半个小时，全部都说了，感觉不错，昨天收到了广州线下的面试邀请，车票已经买好了，转手的收到京东offer，然后退票，血亏9块钱</p>
<p>奇安信：错过了笔试，问了一下说只能等春招。</p>
<p>老虎集团：错过了笔试</p>
<p>随手科技：11月中左右随手说我简历过了晚上笔试，发过来一份笔试，半小时后发回去，然后第二天就收到了一面邀请，过程很顺利，然后隔天就二面，也很顺利，过了几天就HR，也很顺利，说让我尽快来实习，最后也拿到了offer</p>
<p>拼多多：内推后一直初筛，后面直接挂了，暂不匹配。据说拼多多加班很严重，虽然给的很香。</p>
<p><img src="@source/blog/2019-summarize/img/2.png" alt=""></p>
<h2 id="_03-感想" tabindex="-1"><a class="header-anchor" href="#_03-感想" aria-hidden="true">#</a> 03 感想</h2>
<p>想着秋招之路真的很艰辛啊，看到别人都offer拿到手抖，我却是一直白给，曾经几度怀疑人生，人间不值得。之前已经准备好想考公了，发现竞争比互联网还大，学习了两个星期，果断放弃。反正越到后面就越要越有信心，坚持就是胜利！等大佬们的offer都不要之后，我们就有最好的机会了，不要放弃呀各位牛友们。</p>
<p><img src="@source/blog/2019-summarize/img/3.png" alt=""></p>
<h2 id="_04-建议" tabindex="-1"><a class="header-anchor" href="#_04-建议" aria-hidden="true">#</a> 04 建议</h2>
<p>结合笔者在此次秋招中吸取的经验，以及浏览各大牛友的面试经验，在此总结一下如何应对残酷的秋招或者春招。一般来说秋招是最大的一次招聘会，公司都会在7月（最早）开始，到12月底（最晚）来进行招聘人才。互联网公司一般都是比较早的，银行政府类企业就比较晚。</p>
<p>那么在校生或者已经外出实习的小伙伴怎么复习呢？</p>
<h5 id="尽早实习" tabindex="-1"><a class="header-anchor" href="#尽早实习" aria-hidden="true">#</a> <strong>尽早实习</strong></h5>
<p>给师弟师妹的建议，大二大三就要出去找一份好的实习，比如说腾讯那种，到了春招秋招你那offer的概率起码比同龄人高50%以上。实习经历是互联网大厂最注重的一个经历，这既是一个共识也是一个择优录取的过程。</p>
<h5 id="注重基础" tabindex="-1"><a class="header-anchor" href="#注重基础" aria-hidden="true">#</a> <strong>注重基础</strong></h5>
<p>在校生一般公司不会要求太多项目或者架构方面的知识，只要好好复习一下基础知识，不用搞花里胡哨的不实用的，写一两个比较好的项目，用到的知识点比较多，也有深度就更好了，不要写出简单页面就满足。（前端）基础的话，我前面发过一篇技术书籍推荐的文章，大家可以好好吃透里面的内容，毕竟我也是这样过来的。</p>
<h5 id="关注新技术" tabindex="-1"><a class="header-anchor" href="#关注新技术" aria-hidden="true">#</a> <strong>关注新技术</strong></h5>
<p>由于前端的变化近几年比较大，我们需要多关注前端的知识变迁，比如框架技术，重要是关注他的原理，比如vue的数据绑定如何实现，proxy有什么用等。一定要关注ES6和pngack，面试必考。除此之外多关注网络方面的知识，前端很喜欢考这个，把图解HTTP原理看懂就好。</p>
<h5 id="关注架构" tabindex="-1"><a class="header-anchor" href="#关注架构" aria-hidden="true">#</a> <strong>关注架构</strong></h5>
<p>虽然我们暂时用不到，但是面试到了总监或者leader面的时候，会喜欢问架构的知识，不会细问基础实现。所以也要关注前端工程化的知识，node那些，近来也考得不少。如果你想去头条那些注重算法的公司，刷leetcode，熟悉常用的排序算法实现，要会手撕。</p>
<p>面试过程一定要有技巧，尽量引着面试官走，问倒了你不要慌，你可以直接不知道，但你了解过哪个哪个，然后有相似之处即可，不懂装懂反而会减分。多看一下牛客网上面的面试经验，你会有大大的收获的，但是要理解，背题库不可取，学会融会贯通，知识都是有相关联之处，学会建立自己的知识体系。</p>
<p>最后祝大家都拿到满意的offer！！！</p>
<p><img src="@source/blog/common/2.gif" alt=""></p>
</div></template>
