<template><div><blockquote>
<p>疫情之下，很多同学都难以找到一份好工作，很多公司招聘需求也比较少，那么我们该如何辨别是否是靠谱的呢？</p>
</blockquote>
<p><img src="@source/blog/common/1.gif" alt=" "></p>
<h2 id="_01-前言" tabindex="-1"><a class="header-anchor" href="#_01-前言" aria-hidden="true">#</a> 01 前言</h2>
<p>大家都知道，临近毕业很多事情都变得忙碌起来了，以前三年没有想过的事情如今一年就要全部想清楚，你说这能不难嘛？然而最近的疫情影响，大家都难以找到工作，一下子压力就大了起来，老师同学都鼓励大家积极就业，其实道理我们都懂，但是我的老板到底在哪？</p>
<p>除了我们要考虑就业、找工作的问题之外，我们还要好好准备我们的毕业设计、毕业论文。都说我们是见证历史的一届，美股熔断、高考延期、奥运推迟...</p>
<p>说实在的，这一年发生了太多的事情以前从来都不敢想象的，本应该大家都快乐去踏进社会，开启一段新的旅程。但是即使我们很难，但是我们总归要一步步找到方法，方法总比困难多，社会才会进步，我们也是。所以我们居家的这段时间也可先解决我们的未来一大难题——找工作。接下来就思考和判断一下我们应该如何找到一份好工作。</p>
<h2 id="_02-公司定位" tabindex="-1"><a class="header-anchor" href="#_02-公司定位" aria-hidden="true">#</a> 02 公司定位</h2>
<p>之前我就写过一篇关于毕业何去何从的文章，简要说了一下我们该如何去选择大公司和小公司的问题。这里我也再提醒一下，找工作先定位自己的目标，是去大公司还是创业公司？我们先把自己的定位做好，然后才慢慢准备其他的内容。</p>
<h5 id="能力要求" tabindex="-1"><a class="header-anchor" href="#能力要求" aria-hidden="true">#</a> 能力要求</h5>
<p>大公司和小公司的能力要求是不一样的，先说一下大公司，它里面的体系都是比较完整的，有系统的培训体系、薪酬福利、发展路线等，相对来说是一个人人向往的办公环境。除此之外，我们还可以与很多大牛同事共事，从技术成长上面来说我们是比较好的，我们会对某一个领域的知识有独到的见解。大公司可能会每周/每月定时举行一次技术交流会，分享技术心得与问题的解决方法，这些都是很宝贵的资源，外面也很难听到这些知识。</p>
<h5 id="薪酬福利" tabindex="-1"><a class="header-anchor" href="#薪酬福利" aria-hidden="true">#</a> 薪酬福利</h5>
<p>除了一些隐形的福利，我们也更关心薪酬的多少，一般来说大公司的薪酬是比小公司多，而且还有各种福利等。公司体量的大就代表了它有一定的稳定性，跟你的机会也相对来说比较多，即使部门不太合适你也可以进行内部转岗。但是进大公司也不是大多数人都可以去的，有一定的门槛和要求，除了本科应届生还有应届的硕士研究生跟你一同竞争。</p>
<p>再来看一下小公司，我们知道初创公司一般都是比较小的公司，团队只有十几人左右，分工相对来说不是很明确，每个人都应该懂得很多业务知识与技术知识，对人员的技术能力也会比大公司的好。一般来说你需要懂前后端的交互、系统的部署等跨专业知识的方面，我之前实习的公司就要要求你有linux的知识，懂得上线和部署系统，虽然你是前端开发。</p>
<p>然后公司的稳定性也不好，我们知道创业的成功率不高，而且我们的基本薪资是比较少的，这些才是我们关心的事情。总的来说，大家好好准备，能去大公司的话一定要去试一下，不要再小公司后悔当初没有努力。</p>
<p><img src="@source/blog/howToFindJobs/img/1.png" alt=" "></p>
<h2 id="_03-公司背景" tabindex="-1"><a class="header-anchor" href="#_03-公司背景" aria-hidden="true">#</a> 03 公司背景</h2>
<p>除了关注一些比较大方向的内容之外，我们在面试之前一定要看一下公司的背景是怎么样的，公司的规模是多大的，业务有哪些方面以及现在已经投放到市场的产品有哪些。总之想别人对你进行背景调查一样，你也应该提前了解一下你即将面试的公司是怎么样的。有些面试的时候还会问你，你对我们公司的了解有多少？这其实也是一道开放的题目，就是为了了解候选人是否认真了解过公司，还是只是海投。</p>
<p>我们查看公司的背景可以通过以下的三个方面来看：</p>
<ul>
<li>估值</li>
</ul>
<p>首先我们应该关心一下公司的估值有多少，虽然这些钱跟我们没有什么关系。但是这也是一个评估你们公司是否有实力和有前途，通过大致的估值你可以了解到你们公司的市场业务是有前景，是否有发展前途。可以通过查看公司的CEO，看是哪一行业的任务，他的高层政策方针是否有问题，领导下的公司走向等。还有一个就是查看公司的融资情况，这个也是很有代表性的，一般来说越到后面你的公司存活率就会越高，因为别人舍得给你投资就证明你们做的产品是有价值的。</p>
<ul>
<li>业务</li>
</ul>
<p>公司的业务，大部分是指公司现在正在做的一些产品是怎么样的，产品是否正在盈利与用户规模有多大。同时我们也要关注我们自身的利益，薪酬制度是否合理，你目前的情况是否与当前的薪资相匹配。最后一个就是技术栈，公司用的技术到底是怎么样的，是否与市场接轨。公司的技术关系到你以后的发展方向，因为你不可能一直在那个公司干，所以你学的技术一定是要和国内大部分的互联网企业用的技术是相通的。</p>
<p>关于技术成长，你需要考虑公司对实习生的培训制度，当你进去之后有没有人愿意带你。如果是没有人带你，可能你在里面过的比较辛苦，因为业务你不熟悉，技术你也跟不上，怎一个难字了得。</p>
<ul>
<li>舆情</li>
</ul>
<p>舆论方面，我觉得是最能真实反映公司的情况的，大家想想吃瓜群众是很多的。一旦公司出了什么事情，总会有员工出来发表或者吐槽一下。比如最近哪个公司进行大规模的裁员，那么我们想想，自己还会想去吗？又或者公司要求全员996且不得有意见等，这些其实都是舆论，都会在互联网这个圈子里面流传。还有一个就是领导的人品如何，跟对了老板你就会前途一片光明，但是跟不对你就有点不妥了。</p>
<p>其实舆论方面大部分是一些很小的事情，但是事情的影响很恶劣，所以总会被推到风口浪尖上面。</p>
<p><img src="@source/blog/howToFindJobs/img/2.png" alt=" "></p>
<h2 id="_04-offer选择" tabindex="-1"><a class="header-anchor" href="#_04-offer选择" aria-hidden="true">#</a> 04 offer选择</h2>
<p>一般来说你如果能顺利拿到满意的offer就应该马上签了，犹豫不得，特别是你有且仅有的offer。因为假如你在规定的时间内没有答复或者同意对方的offer，可能直接废弃你的offer然后重新甄选候选人。假如是一个大公司，更应该是快点决定，因为公司都会有一个简历人才库，其中都有很多厉害的人在里面躺着，985/211/海外留学等。所以我当时是很快就同意了，知道自己菜没办法。</p>
<h2 id="_05-小结" tabindex="-1"><a class="header-anchor" href="#_05-小结" aria-hidden="true">#</a> 05 小结</h2>
<p>疫情期间，家家都有一本难念的经。其实每个公司都想更好地发展，扩大生产和经营的规模，加大对市场人才的录用率。但是奈何现在大家都是处于一种经济困难的状态，企业复工率也是比较低，业务和产品都得不到发展等各种困难，真实来说现在能找到工作也是一件不错的事情了。</p>
<p>还是那句话，市场永远都是青睐那些有技术的高端人才，只有你有技术，迟一年去好的公司又如何，待春暖花开时，自然就是一片好的生态。我们在家也要好好准备工作、面试、毕设、论文的事情，并不是你们所说的煲剧看电影打游戏睡懒觉的状态，好好准备自己如何在弯道超车，但是车速也不宜过快，好好沉淀自己，切勿心浮气躁。</p>
<p><img src="@source/blog/common/2.gif" alt=" "></p>
</div></template>
