<template><div><h1 id="程序员六个赚外快的方法-建议收藏" tabindex="-1"><a class="header-anchor" href="#程序员六个赚外快的方法-建议收藏" aria-hidden="true">#</a> 程序员六个赚外快的方法（建议收藏）</h1>
<blockquote>
<p>在你低头写代码的同时，很多人都在高调赚外快</p>
</blockquote>
<p><img src="@source/blog/common/1.gif" alt=" "></p>
<h2 id="_01-前言" tabindex="-1"><a class="header-anchor" href="#_01-前言" aria-hidden="true">#</a> 01 前言</h2>
<p>近日闲来无事，总喜欢钻研一些“技巧”型的东西，也一直考虑别的除技术以外的东西（虽然现在技术不好），想想也觉得无事，毕竟可能以后就没有什么时间去想了。</p>
<p>一直都炒的很热的问题，关于程序员如何去赚取外快的问题。以前自己的想法就是去接单，做私活呀，钱来的很快，但是也很累。想想这个终究也不是什么长久之计，反观一下当今的市场，想想还是有一些可以适合程序员做的事情的。接下来一一分享一下。</p>
<p><img src="@source/blog/howToEarnMoney/img/1.jpg" alt=" "></p>
<h2 id="_02-方法论" tabindex="-1"><a class="header-anchor" href="#_02-方法论" aria-hidden="true">#</a> 02 方法论</h2>
<p>认真思考了一下，大概有6种方法可以值得一试，当然是在你的技术有一定的实力，或者你的关注人数比较多的时候，有个人的影响力的前提下，利用以下介绍的方法会非常奏效。</p>
<ul>
<li>接外包项目</li>
</ul>
<p>这是一个非常好的赚钱方法，首先是因为给的钱多，对于技术强的同学来说不是什么大问题，但是对于菜鸟一族来说就先别碰这个东西了，你也做不来。也许很多人都抱怨说自己的工作已经很辛苦了，哪里还有时间这搞这些的东西呀，恨不得回家洗洗睡。这里我就像大家灌一碗毒鸡汤了，时间就像海绵，挤一下总会有的，看你是不是想赚钱而已。大家也可以试一下这些平台：</p>
<ol>
<li>猪八戒网</li>
<li>码市</li>
<li>云沃客</li>
<li>解放号</li>
<li>程序员客栈</li>
</ol>
<p>大家可以先去了解一下，试一下水，万一有点东西呢？</p>
<ul>
<li>做运营</li>
</ul>
<p>相比于上面这种接外包的形式，做运营就是比较好的方案了，但是唯一的缺点就是涨粉比较难，不仅要你持续输出，获取第一批种子用户，还需要你的文章价值和质量都比较高，得到别人的认可。如果大家比较喜欢去分享和码字的话一定要去尝试一下，不仅可以锻炼你自己的能力，还能赚一些钱（别人打赏或者广告）。更重要的是你可以建立自己的品牌，当你有自己的品牌的时候，很多事情就比较顺利了。</p>
<p>其实现在大家都提倡知识付费的时代，假如你有一种分享为乐的心态，一定要尝试这种方法。另外现在掘金小册也是一种不错的知识付费的平台，还有极客时间，知识星球等。大家可以根据自己的需求来选择属于自己的平台。呼吁大家把更优质的内容分享出来，让大家都得到提升，自己也得到收获。</p>
<ul>
<li>讲师</li>
</ul>
<p>这种方法需要你有比较多的时间，也需要你有一定的社会阅历和公司经验，有说话技巧以及口才等。你可以选择一些培训机构，申请去做一些兼职的讲师，分享社会工作经验已经学习方法等。还有一些高校也可以去做兼职讲师，因为高校很多都是在书本上的知识，很多一线的公司用的技术，需要的知识高校都接触不到，更重要的是很多老师也愿意请你们来普及一下社会的需求，同步自己的教学内容。</p>
<p>一般来说你也会得到相应的报酬，几千几万的都有，一般你的工作经验起码也要几年以上别人才会相信你说的东西，而且你最好是一线知名的企业，才会有更多的机会做这件事情。</p>
<p>除了培训机构和高校，你也可以去尝试录制课程，然后发布在各大教学平台，比如极客时间，慕课网等。这种方法也是不错的，但是总归那句话，有知识和有阅历。我们可以去看一下线上的课程卖的价格也不低，虽然不会都到你的手上，但是你也可以获得大部分的收益。</p>
<ul>
<li>理财投资</li>
</ul>
<p>关于理财投资，很多人就觉得是去炒股等高风险高收益的途径，但是作为程序员还是有几分理性在内心的。大家可以去尝试买基金、投资等风险相对比较低的方式。如果你实在是理财小白，你也可以把工资放余额宝或者微信理财，也是不错的。前提是你的本金足够多，收益才会多。</p>
<ul>
<li>积累人脉，做咨询</li>
</ul>
<p>这种方法一般都是工作5年以上的老司机才会比较好，一来你的人脉积累肯定是有的，这时候你也建立起自己的朋友圈（不是微信朋友圈），你可以建立自己的圈子，提供收费咨询等。这也是一种不错的选择。</p>
<p>我觉得做咨询相对来说是一种零成本的服务，唯一要的就是你的脑子。所以大家要是以后想在这个方向发展的话，记得从现在起开始就好好充电，争取实现自己的目标。</p>
<ul>
<li>大厂内推</li>
</ul>
<p>关于内推，大家可能不知道推荐别人成功入职也是有奖金的，而且奖金还不少呢。之前听网上说像字节跳动的大公司，内推成功的话就会拿到几千块的奖励。所以很多大厂的程序员都喜欢推荐别人，不是因为他们有多好，而是有收益拿。当然也有一些是想真心让学弟学妹找到好工作，回馈社会的人。</p>
<p>所以你如果是大厂的开发人员，每一年你都可以拿着你的个人内推码发给学弟学妹，那么他们如果成功入职了，你就会拿到相应的奖金。但是这种方法也不是每个人都有机会，毕竟去大厂的人还是少数，小公司应该也不会有这种内推的操作。</p>
<p><img src="@source/blog/howToEarnMoney/img/2.jpg" alt=" "></p>
<h2 id="_03-思考" tabindex="-1"><a class="header-anchor" href="#_03-思考" aria-hidden="true">#</a> 03 思考</h2>
<p>其实个人是很羡慕一些人，能够在工作之余拿出自己的时间做别的事情，不管是学习也好，赚外快也好，奈何自己现在没有这种能力，毕竟目前的工作经验不足，相信自己在未来几年会有所发展。能够尝试一下上面提到的方法，那么我们现在能做什么呢？当然是学习充电呀。</p>
<p>之前很多人都说学习无用论，老是拿别人初中毕业，如今身家多少的事情来打压我们。其实我对这种人是很鄙视的，为什么呢？因为你看到的是一个人，这里面的偶然性非常高，或许他中间买彩票呢？或者跟上了一个很好的机会呢？或者刚好老板提拔？或者刚好创业成功？这些我们是不知道的，我们看到的只是他的结果。</p>
<p>所以我想说不要觉得别人偶然的成功，来断定我们的学习无用，假如你说90%的初中毕业生如今都混的很好，我就相信了。现在大家的学习素质或者学习激情都普遍提高，大家也越来越支持知识付费的时代，大家也应该努力创建出优质的内容，回馈社会，尊重知识产权，尊重劳动成功，别人自然喜欢给你买单。</p>
<p><img src="@source/blog/howToEarnMoney/img/3.jpg" alt=" "></p>
<h2 id="_04-小结" tabindex="-1"><a class="header-anchor" href="#_04-小结" aria-hidden="true">#</a> 04 小结</h2>
<p>通过上面的介绍，我相信很多小伙伴都会想试一下，但是大家也不用急。毕竟像那句话说的“钱是赚不完的，活是干不完的”一样，如果你是在校的大学生，一定好好利用这段充裕的时间好好提升自己，特别是技术相关的东西，对以后找工作很有帮助；如果你是在职的职场人士，你可以根据自己的时间和精力选择你认为合适的方式，理性选择；如果你是成功人士，那...那就教一下我怎么做，感激不尽！</p>
<p>好了，以上是这篇文章的全部内容，觉得文章不错的点赞收藏，文章同步到公众号《前端小时》，欢迎关注！希望大家都可以找到自己的方向，共勉！</p>
<p><img src="@source/blog/common/2.gif" alt=""></p>
</div></template>
