<template><div><h2 id="开始面试-我该准备什么" tabindex="-1"><a class="header-anchor" href="#开始面试-我该准备什么" aria-hidden="true">#</a> 开始面试，我该准备什么</h2>
<blockquote>
<p>&quot;别人怀宝剑，我有笔如刀&quot;</p>
</blockquote>
<p><img src="@source/blog/common/1.gif" alt=""></p>
<h2 id="_01-前言" tabindex="-1"><a class="header-anchor" href="#_01-前言" aria-hidden="true">#</a> 01 前言</h2>
<p>临近毕业，相信大家都会忙着找工作，面试等，即使大三的小伙伴也会想着出去找一份实习单位，增加自己的工作经历，为来年的毕业做准备。那么我们找工作之前必须要清楚几件事情，否则找工作可能不会怎么顺利。</p>
<p><img src="@source/blog/interviewTip/img/1.png" alt=""></p>
<h2 id="_02-面试准备" tabindex="-1"><a class="header-anchor" href="#_02-面试准备" aria-hidden="true">#</a> 02 面试准备</h2>
<p>我们找工作要注意以下几件事情：</p>
<ul>
<li>如何写一封好简历</li>
<li>什么时候投简历</li>
<li>如何判断公司是否靠谱</li>
<li>面试该如何准备</li>
<li>面试被问倒了怎么办</li>
<li>如何跟HR谈钱</li>
</ul>
<h5 id="如何写一封好简历" tabindex="-1"><a class="header-anchor" href="#如何写一封好简历" aria-hidden="true">#</a> <strong>如何写一封好简历</strong></h5>
<p>简历是我们面试的敲门砖，如果一开始你的简历写不好，往往就可能错过这份工作的机会。简历投递后，一般公司都会有专门的HR进行预筛选。我们要接受的现实是，学历和学校我们是改变不了的，对于公司只收研究生学历或者985/211大学的，我们就根据自己的情况进行投递。</p>
<p>还有非常重要的一点就是简历不能作假，一旦发现作假可能就会被公司列入黑名单。这个可不是开玩笑，可能你以后在互联网的圈子也混的不太好。所谓立人以立德为先，必须诚实守信。对于自己的学历和学校要如实填写，没有工作经验不要紧，一般应届生都很少有工作经验，你只要好好把基础掌握，写上几个有深度的项目即可。</p>
<p>那么我们该注意什么呢？</p>
<p><img src="@source/blog/interviewTip/img/2.png" alt=""></p>
<ul>
<li>简历基本模块</li>
<li>丰富项目经历</li>
<li>丰富在校经历</li>
<li>工作经历(加分)</li>
</ul>
<h6 id="简历基本模块" tabindex="-1"><a class="header-anchor" href="#简历基本模块" aria-hidden="true">#</a> <strong>简历基本模块</strong></h6>
<p><img src="@source/blog/interviewTip/img/resume.png" alt=""></p>
<p>简历遵循的应该是简洁美观，不要搞那些花里胡哨的页面，突出重点即可。让HR第一眼看到你应聘的岗位，你的学历学校等信息，HR应该不会过多关注你的技术点的，那是面试官的事情。首先你得过第一关，简历不会被筛。</p>
<h6 id="丰富项目经历" tabindex="-1"><a class="header-anchor" href="#丰富项目经历" aria-hidden="true">#</a> <strong>丰富项目经历</strong></h6>
<p>我们应届毕业生都有这样的感觉，不知道项目写什么，造成了没东西可写的尴尬局面。但是仔细想想，大学四年好像也没做什么有用的项目，是不是就没办法了呢？</p>
<p>其实我们可以对应自己的岗位特点，看一下网上公司的招聘需求，然后制定相应的计划。一般项目不需要太大，涵盖基本的知识点即可，面试官也会知道应届生是不会写出很厉害的项目的。我们可以在网上(github)看几个项目实战，比如vue项目实战或者小程序等，跟着学习一遍，把里面的知识点学懂弄通，拓展开来，就可以写在你的项目经历上面。</p>
<h5 id="丰富在校经历" tabindex="-1"><a class="header-anchor" href="#丰富在校经历" aria-hidden="true">#</a> <strong>丰富在校经历</strong></h5>
<p>一般每个学校都会有类似科技园的地方，都是有老师到头建立的实验室，那里才是真正学习的地方。我们建议，每个学习计算机的同学都要抓住机会去学习，不要待在宿舍或者图书馆等你认为学习很好的地方。尽早选择你的方向，前端后台移动端等，然后加入团队，以项目驱动来学习，一年下来肯定比你在课堂上和自学上收获的还要多。</p>
<p>然后要抓住每一年的创新创业比赛，科技比赛等，积极参加，这都是为了以后你写简历有东西可写，参加越多越好，获奖几率就会高。一般面试官也会注意这一部分的内容，说明你是一个动手能力强的人，都会受到面试官的青睐。</p>
<p><img src="@source/blog/interviewTip/img/3.png" alt=""></p>
<h6 id="工作经历" tabindex="-1"><a class="header-anchor" href="#工作经历" aria-hidden="true">#</a> <strong>工作经历</strong></h6>
<p>建议大家都尽可能在大三的时候去面试找工作，提前熟悉面试流程，给自己一个缓冲的阶段。我认为在大三找工作有很多的好处，特别是对于个人技术的提升是有很大作用的，你会在这一段时间慢慢建立自己的知识体系，把知识框架都建立起来，后期就是慢慢填充知识的阶段。</p>
<p>这里工作其实是互联网公司很青睐那些有工作经验的同学，你想想每个人简历上都有至少一个的工作经历，但是你没有，你就失去了和别人竞争的资本。互联网公司的简历一般都会有评分系统的，简单来说简历的最终得分是会影响到你的薪资的。比如可能有工作经历和没有的就会相差一个等级，面试的几率也会降低。</p>
<p><img src="@source/blog/interviewTip/img/4.png" alt=""></p>
<h5 id="什么时候投简历" tabindex="-1"><a class="header-anchor" href="#什么时候投简历" aria-hidden="true">#</a> <strong>什么时候投简历</strong></h5>
<p>投简历的时机也非常重要，一般我们都推荐在提前批的时候就应该把自己的简历投出去，因为这个时候面试的机会很大，比正常流程的校招渠道要快，拿到的结果也快。所以说抓住提前批，你的面试通过几率也很大，一般公司会有sp offer，都会在提前批发出，所以好好准备，不要以为我还没准备好就不投了。</p>
<p>如果你有师兄师姐在某个公司里面，你也可以找他们进行内推，这个面试的机会也非常大，可以让你的简历免筛选。而且还可以找你的师兄师姐询问面试进度，不会让你一直都不知道自己的状态。他们也会很乐意帮你的，因为你过了他们有奖金。</p>
<p>如果你错失了提前批那也没关系，好好准备校招的流程，在官网上面投递简历或者找人内推，都是一样的，重要的是自身知识硬。</p>
<p>如果实在不幸，校招也没机会了，别担心还有补招阶段。一般如果春招5月左右到6月都会有补招的机会，只要你留意一下牛客网上面的信息就好。秋招的话一般到12月都还有机会，这时候千万不要慌，机会还有，一直准备面试就好，坚持就是胜利，这不是吹的，一定要坚持。</p>
<p><img src="@source/blog/interviewTip/img/5.png" alt=""></p>
<h5 id="如何判断公司是否靠谱" tabindex="-1"><a class="header-anchor" href="#如何判断公司是否靠谱" aria-hidden="true">#</a> <strong>如何判断公司是否靠谱</strong></h5>
<p>判断公司是否靠谱，我们的第一感觉就是大公司，BAT级别的肯定不会错。但是一般不是每个同学都有机会进入大公司工作，很大一部分还是在小公司的。第一个一般我们看公司的规模多大，在职员工多少；公司融资情况怎么样；公司涉及的行业未来方向怎么样；公司福利待遇如何等。</p>
<p>第二个我们看公司用的技术怎么样，技术团队如何。这关乎你以后技术的成长，是否可以在里面学到真正的东西，如果上述的都符合你的要求，那么你就可以进行简历的投递。</p>
<h5 id="面试该如何准备" tabindex="-1"><a class="header-anchor" href="#面试该如何准备" aria-hidden="true">#</a> <strong>面试该如何准备</strong></h5>
<p>技术面试一般是分为2~3轮，每一轮的侧重点是不一样的。建议同学们先准备一下基础的知识点，建立自己的基础知识体系，然后找相应的资料或者书籍进行查漏补缺。然后把每一次面试的题目都要记录下来，面试之后进行复盘，找出自己存在的问题，总结面试经验。当你面试多了，自然就懂得其中的道理。</p>
<p>多看一下面试经验，看一下别人的面试题，一般都大同小异。把每一道题背后涉及的知识原理都弄懂，拓展这一道题的深度。牛客网上面都有一些互联网公司的面试笔试题，我们可以多做总结。</p>
<h5 id="面试被问倒了怎么办" tabindex="-1"><a class="header-anchor" href="#面试被问倒了怎么办" aria-hidden="true">#</a> <strong>面试被问倒了怎么办</strong></h5>
<p>面试其实就是一个知识碰撞的过程，遇到不会的题很正常，也无需惊慌，不懂装懂反而会降低面试官对自己的印象。一般我们遇到不会的题目直接说不会，但是你遇到哪个哪个类似的问题，你是如何解决它的，这样回答也没问题。</p>
<p>但是我们不要不说话，半天在那里沉默。遇到不会也好，也要说一点其他沾边的知识点出来，这也是一种应对方法。很多情况下的知识宽度和深度都不会比面试官高，甚至都没有他要求的基础高。所以好好总结自己，即使不过也为下一次打基础。</p>
<h5 id="如何跟hr谈钱" tabindex="-1"><a class="header-anchor" href="#如何跟hr谈钱" aria-hidden="true">#</a> <strong>如何跟HR谈钱</strong></h5>
<p>我们对于这个问题不用回避，毕竟你也是为了生活才和公司工作，人家给你报酬也是理所当然的。钱不到位就没有存在的价值了。</p>
<p>我们谈薪资不是随便说的，一般都参照一下别人发的工资多少。可以看一下offershow上面给的多少，然后直接说那个就好，上面的都是别人已经到手的工资情况，一般也就是那个价。问薪资的同时，一般也要注意一下：</p>
<ul>
<li>是否996</li>
<li>加班情况如何</li>
<li>上班时间如何</li>
<li>福利情况</li>
</ul>
<h2 id="_03-小结" tabindex="-1"><a class="header-anchor" href="#_03-小结" aria-hidden="true">#</a> 03 小结</h2>
<p>简历投递找工作是大部分学生都会经历的事情，坦然面对就好。找工作过程中遇到的问题慢慢解决就好，不要放弃自己当初的希望。</p>
<p>找工作越早进行越好，个人觉得应该从大一就开始准备，因为你要写相关的在校经历，从大一开始就应该参加比赛多一点，丰富你的简历内容。</p>
<p>预祝大家都可以拿到心仪的offer！</p>
<p><img src="@source/blog/common/2.gif" alt=""></p>
</div></template>
