<template><div><blockquote>
<p>曾经看到一句话，说一个伟大的黑客不是因为技术有多强，而是他有多少厉害的工具。</p>
</blockquote>
<p><img src="@source/blog/common/1.gif" alt=""></p>
<h2 id="_01-前言" tabindex="-1"><a class="header-anchor" href="#_01-前言" aria-hidden="true">#</a> 01 前言</h2>
<p>早在几年前，我们或许还没有接触前端的方向，甚至不知道计算机方向学的是什么。记得计算机组成原理老师说过，计算机的学生是肯定会修计算机的。其实我不知道是不是因为学科名字的概念，一时竟无言以对，因为大学教会我们的知识中，是没有计算机维修这一门课的。</p>
<p>所以在校期间我们唯一能做的就是上课努力听讲，紧跟老师的脚步，认真完成课后作业或者检查的时候一通猛抄，应对了事。本科教育本来就是一个以素质教育为主，以培养学生的计算机基础为导向，并不是教会你要学习哪一种技术来应对将来的工作。举个简单的例子，大部分的大学是没有开设前端程序设计的课程，但是你看一下外面招聘很多都有招人，但是却招不到。</p>
<p>说到这里好像有点偏题了，回归题目本身。我们在学习前端的过程中，肯定会积累自己的一个技术集，也就是你认为好用的有哪些技术。一开始我们接触的信息可能会比较局限，但是感谢互联网平台让我们相遇。所以我接下来会分享一下我在学习的过程中收集的技术。</p>
<h2 id="_02-学习网站" tabindex="-1"><a class="header-anchor" href="#_02-学习网站" aria-hidden="true">#</a> 02 学习网站</h2>
<p>可能一开始大家都是看一些比较零星的知识点，没有一个系统的知识来学习。我们可以细想一下假如你要学习一门新的技术，第一时间肯定是谷歌一下这门技术是什么，然后你再搜索一下入门。到此为止你已经入门了，剩下的就是时间的关系了。所以我们很难想象之前没有互联网的时候是怎么学习的。可以看一下的有：</p>
<ul>
<li>慕课网</li>
<li>菜鸟教程</li>
<li></li>
</ul>
<p>这里我学习前端的时候，经常逛的一个网站就是慕课网，上面的视频可以让我们轻松一门一个知识点，但不是全部。而且很多系统的知识都是要收费的，所以我们可以选择看一些简单的、免费的入门视频。</p>
<p>暂无头绪，未完。。。</p>
</div></template>
