<template><div><blockquote>
<p>HR面试是我们的最后一关，主要考察你的一些非技术的能力，看你的价值观是否和公司的一致</p>
</blockquote>
<p><img src="@source/blog/common/1.gif" alt=" "></p>
<h2 id="_01-前言" tabindex="-1"><a class="header-anchor" href="#_01-前言" aria-hidden="true">#</a> 01 前言</h2>
<p>HR面试是我们拿offer的最后一关，其实我们到了这一关的话我们就离offer不远了。HR其实考核的主要是了解你是否可以适应公司的文化，你是否可以更快速地融入技术团队等方面，最重要的是看你是否能够在较长的时间服务公司，为公司做贡献。除了看你软能力之外的方面，有些HR面试还会与你进行谈薪资。</p>
<p>但是很多时候我们是没有工资可谈的，有很多原因。比如可能是由于你的学校限制、或者是你的学历限制等，这些我们是无法改变的，但是也有可能是今年公司不会给你议价的机会，也就是统一的白菜价。</p>
<h2 id="_02-常见的问题" tabindex="-1"><a class="header-anchor" href="#_02-常见的问题" aria-hidden="true">#</a> 02 常见的问题</h2>
<h5 id="你的优缺点" tabindex="-1"><a class="header-anchor" href="#你的优缺点" aria-hidden="true">#</a> 你的优缺点</h5>
<p>其实这是一个有陷阱的问题，问你的优点应该是没有问题的，可以说一下自己的学习能力、沟通技巧等方面的事情。但是让你说一下你的缺点的时候其实不是让你真正说自己的缺点，而且让你把你的缺点间接转化成优点。比如其实我们可以这样回答：</p>
<p><strong>优点：</strong></p>
<p>1、学习能力。由于我前端方面的学习起步比较晚，但是经过一年的时间，就可以独立完成网站的一些设计，以及前后端的交互流程，以及我十分关注前端方面的发展，比如一些框架和原理都会进行深入研究且在很短的时间就可以上手使用，掌握得还不错</p>
<p>2、相处能力。在校期间我就经常参加社团活动、参加班干部的竞选等，因为比较爱热闹和与人相处，也交了比较多的朋友，现在的话也和他们保持很好的关系，跟谁都相处比较好，遇到矛盾也能跟对方快速和解等。</p>
<p><strong>缺点：</strong></p>
<p>1、脾气急：比如一个小团队进行一个新的项目研发的时候，一个看似完成不了的项目，经过一段时间的准备都看不到什么效果，队友难免会有一些想放弃。这时候我就会显得脾气急躁，坚持了这么久就放弃？可能会数落他们一顿，打心底里要把事情做好等想法</p>
<p>2、主观感强：比如有时候别人会因为某一件事去尝试说服我，但是又拿不出什么事实证据来，我仍然会坚持自己的观点，不会接受别人无理由的批评，倾向于坚持自己认为正确的观点。</p>
<h5 id="你的未来规划" tabindex="-1"><a class="header-anchor" href="#你的未来规划" aria-hidden="true">#</a> 你的未来规划</h5>
<p>1、疯狂的学习新的知识。因为刚毕业学习的激情、速度以及熬夜的能力可以发挥的淋漓尽致</p>
<p>2、扩展知识面。需要性能高、交互好、视觉美的页面，需要从前端框架选型、架构设计、构建工   具，到后端通信机制、设计与交互、网络和浏览器优化等各方面的知识。同时还要开始提升自己的名气，可以通过发表技术博客，提交和参与开源项目，做部门级公司级还有业界分享，参加业界会议等等</p>
<p>3、承担技术评审、架构设计和项目管理等事情。工作中除了完成自己的事情，可能还需要自己去面试别人或者指导新人，做新人培训，带领新人完成项目等</p>
<p>4、技术 or 管理，这里没有对错之分，只有合不合适。有的人就不善于交流，同时喜欢专研，可以继续走技术的路，发展成专家;有的人则可能有比较强的领导力，可以带领一群人完成项目，那可以转向管理，成为Team Leader等。后期可以根据的兴趣进行目标选择。</p>
<h5 id="最成就-遗憾的事情" tabindex="-1"><a class="header-anchor" href="#最成就-遗憾的事情" aria-hidden="true">#</a> 最成就/遗憾的事情</h5>
<p><strong>最有成就的事情</strong></p>
<p>在大学期间，每天都坚持起床到操场去学习和朗读英语，基本上除了天气原因和身体原因之外没有间断，然后一个学期的努力就顺利通过四六级考试等。或者我在x个月的时间我都坚持做xxx事情，最后我通过这件事情收获了xxx等。</p>
<p><strong>最遗憾的事情</strong></p>
<p>时间规划上面，在xxx期间我们把太多精力在xx活动上面，没有做好时间规划，导致在学习上面有一定的落后，对一些技术的知识积累和学习较少。但是经过一段时间的反思我们已经调整过来，重新找到自己的目标和方向。</p>
<h5 id="平时的时间规划和学习途径" tabindex="-1"><a class="header-anchor" href="#平时的时间规划和学习途径" aria-hidden="true">#</a> 平时的时间规划和学习途径</h5>
<p>其实不光是HR面试会问这个问题，技术面试最后也会说一下这个问题，主要是想了解你的时间规划是怎么样的，是否有一个良好的学习习惯于时间规划方案。我们可以大概说一下自己是怎么利用课余时间的，或者你是怎么安排你的技术学习的，以及你对周末的大段时间是怎么安排的等等。</p>
<p>你也可以谈一下你对碎片时间是怎么利用的，其实我们生活中很多时间都是碎片时间，如何把碎片时间利用好就可以展现出你这个人的时间观念有多高。此外你可以说一下自己是在什么时间进行身体锻炼等细节问题。</p>
<p>关于学习途径方面没有固定的说法，一般就说一下你自己的学习阶段是怎么样的，如基础、进阶等是怎么学习的。我一般都会说前期入门的时候就看一套完整的视频，因为视频相对来说不会很枯燥，让你有兴趣继续学下去。但是入门之后就选择阅读专业书籍来学习，因为书籍才是最系统、最全面的知识仓库。同时这也是一个查漏补缺的重要途径，书籍学习可以有效地弥补视频学习带来的学习不精等缺点。</p>
<h2 id="_03-薪资谈判" tabindex="-1"><a class="header-anchor" href="#_03-薪资谈判" aria-hidden="true">#</a> 03 薪资谈判</h2>
<p>和HR谈薪资的阶段其实就是一个斗智斗勇的过程，在这个过程当中很多人就由于经验不足而得不到一个好的薪资。一般这里就分成两种情况：</p>
<ul>
<li>接受型</li>
</ul>
<p>这类同学可能没有试过怎么谈判，直接不谈，让HR自己给你一个合适的价位。那么这种情况的话只有一种结果，给你的就是批发价（俗称白菜价）。用人单位为了节省开支肯定不会开一个最高的给你，而是一个普通的薪资。或者如果公司没有了HC，那么HR将不会直接拒绝你，而是开给你一个很低的价位让你主动放弃offer。</p>
<ul>
<li>激进型</li>
</ul>
<p>一上来就亮出自己的底牌，说自己薪资要求在xxx k以上。这样的话其实不好，因为假如你说出高于HR心中的价位，可能会拒绝你，但是假如你说低了的话HR一般会直接给你这个。其实这时候我们应该事先摸清公司的价位如何，一般我们都会使用offershow查看一下公司的价位，上面有很多已经拿了offer的小伙伴爆料。</p>
<p>正常来说，我们应该先让HR说一下价位多少，然后你可以根据HR报的价位适当提高一点，好让自己有讨价的余地。但是假如你已经offer拿到手软，不在乎这一个公司的话可以报出你心目当中的价格，即使被对方拒绝了也没有关系，幸运的话你可能拿到这个offer，岂不美哉！</p>
<h2 id="_04-小结" tabindex="-1"><a class="header-anchor" href="#_04-小结" aria-hidden="true">#</a> 04 小结</h2>
<p>由于自己的种种原因，没有很多机会与HR斗智斗勇，奈何offer发过来薪资就直接在上面写着了。但是我们在HR面试的过程中应该要有自信和勇气，比如你已经有了offer什么都好说，这是最有说服力的答案，并不是每个人都可以说。正常来说你可以参考一下行业的标准，或者参考一下跟你水平差不多的同学拿了多少等再说出自己的想法。当然假如你是零offer你也可以说一下心中的价格，说不定人家就中了你的圈套呢！但是一般我们都不会赌这一把，毕竟现在是离offer最近的时候。</p>
<p>第二就是我们永远不要相信口头offer的事情，假如自己已经和HR谈好了，一定要以具体发出的offer为准，不然人家突然说不招人了你也莫得办法。</p>
<p><img src="@source/blog/common/2.gif" alt=" "></p>
</div></template>
