<template><div><blockquote>
<p>古今多少事，都付笑谈中</p>
</blockquote>
<p><img src="@source/blog/graduateThink/img/640.gif" alt=" "></p>
<h2 id="_01-前言" tabindex="-1"><a class="header-anchor" href="#_01-前言" aria-hidden="true">#</a> 01 前言</h2>
<p>想着大家跟我一样，在这个假期都一直待在家里哪里都没有去吧。不知道有多长时间没有喝过一杯奶茶，想着好像已经忘记奶茶是什么味道了。如果不是因为疫情的影响，大家都可能依然做着自己喜欢做的事，跟自己的好朋友一起相聚笑谈人生，也可能会在春节期间走亲访友...</p>
<p>不过，今年让我们意识到，即使一个月不喝奶茶，一个月不出去玩也不会有什么大问题的。朋友圈看的最多的是别人家的厨艺，当然有好也有不好的，一开始也不明白为什么都在发电饭煲做蛋糕的事情，后来才知道大家闲的发慌...</p>
<p><img src="@source/blog/graduateThink/img/1.png" alt=" "></p>
<p>现在经过一个多月的时间，相信大家都想着回去上班或者开学，却被告知要远程上班和在线教学。之前看到小学/初中生的吐槽，“人在家中坐，网课天上来”。但是我们都知道特殊时期大家都是很无奈的办法，这时我们应该深有感触，有些学习需要在学校才有高效率，有些工作在公司才会高产出。</p>
<p>想想之前总觉得假期太短，现在却想着什么时候才可以回学校/公司。虽然说现在还不能按时回校，但是作为一个大四的学生，不知不觉就会面临很多问题让你觉得要思考了...  “毕业论文”、“工作”、“考研失利怎么办”、“就业还是继续考研”等等。</p>
<h2 id="_02-就业率" tabindex="-1"><a class="header-anchor" href="#_02-就业率" aria-hidden="true">#</a> 02 就业率</h2>
<p>今天看到新闻说今年的高校毕业生预计 <strong><font color="#FF7F50">将达到874万人</font></strong>，同比增加了40万人。我们都知道毕业生每一年都会增加，每一年都说今年的就业是最严峻的一年。但是我们从各大高校的数据中看到，似乎学生的就业率却不会受到每年增加的毕业生人数影响，都会保持在90%以上。</p>
<p>但是我们也许忽略了一个问题，真实的情况是否真的是这样呢？还是另有隐情呢？知乎上面有这样一篇文章《抱歉，贵校99%的就业率100%造假》。文章讲到了很多关于就业率的思考，通过一些采访我们也可以知道，部分学校可能会迫于压力提交假的毕业生就业率。</p>
<p>我们在校的时候都会受到老师的教导说“我们应该先就业再择业”，但是我们并不能否认这句话说的有道理。现在的毕业生的换工作频率非常高，造成这个的原因我想可能是由于匆忙就业后发现自己对工作是不满意的。</p>
<p>从自身的情况来说，我们应该清楚地认识到， <strong><font color="#FF7F50">高校毕业生的就业率我们应该保持一个中立理性的态度看待</font></strong>。对于毕业率100%的高校，我们更应该有理由去怀疑这个数字的真实性。一个大学，无论是985/211，还是普通本科的院校，肯定会有一小部分的学生没有就业的。</p>
<p>我们更加注意的一点就是，第一份工作一定要谨慎对待，特别是现在就业形势越来越严峻的情况之下，<strong><font color="#FF7F50">好好珍惜你是校招生的身份</font></strong>，不然走社会招聘的时候就不是这么容易了，除非你有一门很厉害的本领。</p>
<p><img src="@source/blog/graduateThink/img/1.jpg" alt=" "></p>
<h2 id="_03-如何避免毕业踩坑" tabindex="-1"><a class="header-anchor" href="#_03-如何避免毕业踩坑" aria-hidden="true">#</a> 03 如何避免毕业踩坑</h2>
<p>别的专业我不太清楚，但是对于计算机专业的同学来说，就业还是比较容易的。因为每一年的人才缺口是很大的，企业难以招人，准确来说是难以招到优秀的人才，能够掌握计算机基础知识的同学。据我所知，大学很大一部分的时间都是自己在自学的状态。还有很重要的一点就是，可能与企业的人才需求不符，学校教授的知识很大一部分都过时了。</p>
<p>计算机这一块更新换代很快，基本上每半年都会有一些新的技术出现，可能你大一学的东西到了大四就基本不管用了。所以我们一定要在最开始就明确自己的目标，明确自己以后到底要从事哪一种工作，提前努力，笨鸟先飞。</p>
<p>根据自己的情况来说，最晚开始准备的时间不要晚于大三第一学期，最好在大二就开始好好努力了。我们可以理解那些刚上大一的同学期待大学校园的生活，可以放开心情好好去体验一下，我对大一新生的建议就是：</p>
<ul>
<li><strong>参加社团（可以，但别沉迷）</strong></li>
<li><strong>参加学生会（不建议）</strong></li>
<li><strong>参加实验室团队（强烈建议）</strong></li>
</ul>
<p>所以大家是可以尽早确定目标的，然后大三可以尝试去投递简历，你们还有很多的试错机会，不过也不用很担心，就当作是积累经验，提前熟悉招聘的流程，让你成为一个老司机。</p>
<h2 id="_04-临近毕业怎么办" tabindex="-1"><a class="header-anchor" href="#_04-临近毕业怎么办" aria-hidden="true">#</a> 04 临近毕业怎么办</h2>
<p>又或许你是另一种情况，不知不觉就来到了毕业这个阶段，那我们也不用慌，毕竟现在慌也没有用了。首先好好分析自己的强项还有自己薄弱的部分，对症下药，稳扎稳打。一般来说你至少有两次的机会，一次是大三的秋招阶段，另一次就是现在大四的春招阶段了。</p>
<p>我们不得不面对残酷的事实，等过了大四的春招阶段，你找到工作的几率是很低的，对于互联网这个方向来说是这样的。要想在最后的机会脱颖而出，需要你具备几个条件：</p>
<ul>
<li><strong>扎实的基础知识</strong></li>
<li><strong>有实习经历</strong></li>
<li><strong>有获奖经历（省级/国家级）</strong></li>
</ul>
<p>我想在大学这个温室里面，最后我们有可能会剩下第一个条件，有时候甚至也没有，这就更困难了。当然家里有矿那就另当别论了。</p>
<p>当你满足第一个条件的话，你就要时刻留意一下内推的信息，一边准备你的面试，一般来说简历没有问题，那么能不能拿到offer就看你的面试结果了。把自己的时间全身心投入到面试中去，毕竟大学也就这一次可以认真负责地努力一把了，也是关乎你毕业以后是否能够找到一份好工作的事情。</p>
<h2 id="_05-毕业论文" tabindex="-1"><a class="header-anchor" href="#_05-毕业论文" aria-hidden="true">#</a> 05 毕业论文</h2>
<p>希望大家能够通过最后的两次机会找到了自己满意的工作，但是你们也不要着急，毕竟还有一些棘手的事情等着你，如果处理不好，你也有可能失去你的满意工作。那就是能不能毕业的问题。</p>
<p>一般你找到了工作很大程度会去实习单位工作，而这个时候你的毕业论文或者毕业设计是没有做好的，或者压根就把时间放在了准备面试上面没有开始准备写。所以就建议确定了题目之后马上开始设计，把这个事情做好，安心实习，等待毕业。</p>
<p>其实这些事情，当你经历过后你才会知道原来大学毕业也是有一个过渡期的，从学生变成一个社会人的时间你也要提早适应，毕竟人不可能一直处在温室之中，也是要向前走的。我就是这样，早些时候才悟出这些道理。</p>
<h2 id="_06-小结" tabindex="-1"><a class="header-anchor" href="#_06-小结" aria-hidden="true">#</a> 06 小结</h2>
<p>最后再说一下，辅导员或者老师的话不能全信，有时候你还是要有自己的思想，不要被眼前的情况迷惑了自己，网络时代每个人都有权利知道社会到底发生了什么事情，而你又应该如何去面对这些事情。能去实习就尽早出去，积攒社会经验，到毕业的时候就可以把简历写得好看一点，最后你的工资也会高一点。</p>
<p><img src="@source/blog/common/1.gif" alt=" "></p>
</div></template>
