<template><div><blockquote>
<p>经过两个多月的学习与总结，我悟出了一些道理。</p>
</blockquote>
<p><img src="@source/blog/common/1.gif" alt=""></p>
<h2 id="_01-前言" tabindex="-1"><a class="header-anchor" href="#_01-前言" aria-hidden="true">#</a> 01 前言</h2>
<p>很多人都有终身学习的概念，我也一直都是认同的，毕竟只有学习才会让自己适应社会，适应工作与生活。今天我就来谈一下<code v-pre>学习</code>这个比较虚、也比较广的范围，也是对自己坚持两个多月以来的感悟吧。</p>
<p>因为今年疫情的原因，自己也和大多数人一样在家里，响应政府的号召，不出门。但是想着不出门，也不能和好友相聚等，那剩下的只有什么呢？没有，剩下的只是学习。不管你是从事什么行业，学习是一件永远不过时的活动，也是一件让你觉得自己没有浪费时间的事情（有没有收获先不说）。</p>
<p>所以今年春节到现在，基本上每天都在学习和总结，从这两个多月的积累和实践下，从几个方面谈一下自己理解与感悟吧：</p>
<ul>
<li>我是否要早起和学习计划？</li>
<li>我效率不高应该投入更多时间？</li>
<li>我应该有充足的娱乐时间吗？</li>
<li>学习时间总想睡觉？睡觉总想着学习？</li>
</ul>
<h2 id="_02-我是否要早起和学习计划" tabindex="-1"><a class="header-anchor" href="#_02-我是否要早起和学习计划" aria-hidden="true">#</a> 02 我是否要早起和学习计划？</h2>
<p><strong>关于早起</strong></p>
<p>大家应该对鸡汤文要早起的思想洗脑了，认为<code v-pre>早起不是一种形式，而是一种习惯</code>。当然我看过的所有鸡汤文中都详细说了早起有什么好处，早起就该让每个人拥有而且一定会感激自己的早起等等，不可否认，早起可以让人完成很多的工作，在没人打扰，安静的时候效率很高。</p>
<p>但是也不能一概而论，因为早起的前提是<code v-pre>要和身体打好交道</code>，你的身体是否允许你早起。专家都建议你要睡7小时左右，那些都是专业的数据，不可能凭空捏造。那么我们为什么不相信他们的话呢？</p>
<p>总体来说，我们应该<code v-pre>少喝一些剧毒鸡汤</code>，说什么睡4~5个小时也不见自己有什么异样等，那是时间问题。要是你长期这样，违反了生理的规律，肯定是对自己有害的。</p>
<p>有些同学可能受鸡汤文影响，我就亲身经历过，看了一场讲座或者听了一个牛人的分享会，第二天就很早起床。如无意外你肯定很困，效率低下且坚持不过三天。这就是所说的三分钟热度，那是外力来推动你早起，但是<code v-pre>真正做到自觉，还是要内力来推动你</code>。</p>
<p>所以关于早起，我们应该有以下几点：</p>
<ul>
<li>保证睡眠时间早起，让身体充分休息</li>
<li>慢慢提前起床时间，不可突然提前</li>
<li>早起是一个习惯，不是一种形式</li>
</ul>
<p><strong>学习计划</strong></p>
<p>学习是一定要有具体的计划的，为什么呢？假如你没有学习计划，即使你学了很多，投入了很多的时间，你也不知道学了什么，<code v-pre>没有计划，就像没有方向一样</code>，看到什么就学什么。很多初学者都会犯这样的错误，听说哪个框架很火就去学哪一个。</p>
<p>有了学习计划，你就把学习这一个很虚的内容可视化，看到自己的进步和成长，带不走的是书本，但是带的走是知识。</p>
<p>我觉得当你学习到了一个程度之后你就会对学习感到厌倦，会有一种不想学习的感觉。你也会有一种什么都会，但什么也不会的感觉的。学习计划的作用就是让你<code v-pre>记录自己的学习路线</code>，卡在那个地方你都做到心里有数。总结一下：</p>
<ul>
<li>计划是必须的，会让你有清晰的路线</li>
<li>计划可以让你的学习可视化</li>
<li>计划会让你的学习过程更加顺利</li>
</ul>
<h2 id="_03-我效率不高应该投入更多时间" tabindex="-1"><a class="header-anchor" href="#_03-我效率不高应该投入更多时间" aria-hidden="true">#</a> 03 我效率不高应该投入更多时间？</h2>
<p>学习的过程中必定是艰苦的，很多时候自己都是单枪匹马地战斗，没人有带你学习，唯有自己撸起袖子干。但是在这个过程你总会浪费很多时间，甚至有时候还会怀疑人生，为什么我的付出没有回报？</p>
<p>时间是平等的，你没有收获不代表你是一个效率低下的人，可能是没有掌握自己学习方法的人。之前我就写过一篇《番茄工作法》的文章，介绍了一种相对效率高的的学习方法，可以适合大部分人使用。</p>
<p><strong>学习问题</strong></p>
<p>但是也有小伙伴会说，我制订了计划，也有自己的学习方法，但是效率也不行呀？其实这也是分很多种情况，比如你的学习环境问题、你的学习心态或者情绪问题等，<code v-pre>学习=环境+时间+心态+资料</code>。如果你满足这些条件，你应该会有一个良好的学习效果。</p>
<p>假如你有一个知识点弄了许久没有明白，不是时间问题就是智力问题。很多时候都是前者，花多一点时间可以解决99%的问题。就如看书一般，看一遍不懂那就多看几遍，前人深邃的思想哪是你一下子就能领会。</p>
<p><strong>时间投入</strong></p>
<p>时间投入也不是越多越好，大脑就像身体一样，总要休息的。之前的《番茄工作法》也提到，学习25分钟就让自己的大脑休息5分钟，5分钟不是浪费时间，而是为了你更加专注，提高效率。</p>
<p>当你学习<code v-pre>没有心情</code>、<code v-pre>烦躁</code>、<code v-pre>焦虑</code>的时候，是大脑要提醒你换一种方式用脑，应该转移自己的学习内容，或者停止学习，泡上一壶茶发呆一下都可以。时刻记住  <code v-pre>我们是人，不是机器，不可连轴转</code>。</p>
<blockquote>
<p><code v-pre>沉没成本:</code>
学习需要时间，而且是大量的时间，这里面就有沉没成本在里面。所谓时间成本就是你学习了一天毫无收获，那就浪费了一天的时间。举个简单的例子，你在车站等公交车，期间很多的小车经过问你是否要搭乘，但是你拒绝了。最后等了一个小时车也没来，你选择了坐小车。沉没成本就是一小时，已经付出且不可收回的成本。</p>
</blockquote>
<p>我们来小结一下，关于效率不高是否要加大时间的投入，主要有三点：</p>
<ul>
<li>效率不高，应该适当休息而不可强制自己学习</li>
<li>学习烦躁，转换自己的学习内容或者停止学习</li>
<li>学会学习，评估自己的学习会带来的沉没成本</li>
</ul>
<h2 id="_04-我应该有充足的娱乐时间吗" tabindex="-1"><a class="header-anchor" href="#_04-我应该有充足的娱乐时间吗" aria-hidden="true">#</a> 04 我应该有充足的娱乐时间吗？</h2>
<p>这个问题是肯定的的，<code v-pre>生活不止是只有学习和工作，而且还有娱乐，才是生活的意义</code>。但是很多人就宁愿把时间投入到学习当中，也不愿意拿来娱乐。不可否认你可以收获更多，但是你也会相应失去其它的收获。比如为了学习放弃与家人相处，放弃参加讲座，放弃观看演出等。</p>
<p>为什么有人把生活变成了诗和远方呢？因为他们有钱。虽然这是真实的状态，但是作为90后青年也要学会享受生活，别人可以的我们也应该可以，别人可以出国旅游，我可以在中国旅游。别人经济到位豪华游，我们经济不到位就穷游，同样也可以看到诗和远方。</p>
<p>所以关于是否有充足的娱乐时间这个问题上，我们应该要有的。为什么会有奖励这种事情呢？因为你学习了付出了，就有相应对自己的奖励。这样你的大脑才会继续为你工作，继续为你运转。小结一下就是：</p>
<ul>
<li>给自己娱乐的时间，让自己得到精神奖励</li>
<li>除了拥有学习，还要拥有生活</li>
</ul>
<h2 id="_05-学习时间总想睡觉-睡觉总想着学习" tabindex="-1"><a class="header-anchor" href="#_05-学习时间总想睡觉-睡觉总想着学习" aria-hidden="true">#</a> 05 学习时间总想睡觉？睡觉总想着学习？</h2>
<p>有没有这样的情况，当你认真起床学习的时候，发现自己的脑子在睡觉，但是当你更衣准备睡觉的时候，脑子却叫你起床学习。</p>
<p><code v-pre>我：夜深了，要睡觉了哦 脑子：睡什么睡，起来嗨！ 我：...</code></p>
<p>脑子就是有这么神奇，但是也是少数的时候，一般情况下可能是你突然冒出一个想法，让你忍不住要实验一下，或者你想到了一个解决困扰你很久的方法。我就是某天晚上想到了一个很厉害的想法，然后凌晨两点也睡不着，总想着把它实践一下。</p>
<p>不过只要你的学习路线是正确的，时间安排上没有问题，我们是不会出现这种情况的。之前有人就提到我们要是反复许久都睡不着怎么办，是不是应该起来学习？个人看法应该放空你的脑子，不想就好，转移自己的注意力等让自己冷静下来。实在不行，那就起来吧。</p>
<h2 id="_06-小结" tabindex="-1"><a class="header-anchor" href="#_06-小结" aria-hidden="true">#</a> 06 小结</h2>
<p>以上的想法都是最近遇到的，其实想想也没什么了不起的，有时候只是自己不想去想而已。以前总觉得开始做一件事情很难，但是当你把目标进行多步拆解，你会发现你完成的不是一项工程，你只是在搬砖，<code v-pre>最后不知不觉成了一项工程而已</code>。</p>
<p>通过自己学习感悟，也总结了许多问题，之前也不知道番茄工作法的作用，也不知道学校效率与时间的投入问题，还不是总结出来，有自己的思维和想法。</p>
<p>之前我也写过一篇《我为什么不建议大家太专注于学习》的文章，里面除了学习更多要关注的是输出与总结，现在想想，我们应该加上<code v-pre>生活与娱乐</code>。接下来的时间我也会经常更新文章，但应该不会每天都产出，留给自己总结的时间，之前的文章都是很久之前总结没有发表的一些想法而已，那时候也没有开通公众号这个平台。</p>
<p>最后还是感谢大家的关注！让我知道学习的路上不是单枪匹马，还有一群心怀大志的你们。</p>
<p><img src="@source/blog/common/2.gif" alt=""></p>
</div></template>
