<template><div><blockquote>
<p>不知道大家在学校的时候有没有去找过实习，如果你有过一定的实习经验，那么接下来说的事情你应该有所感悟。</p>
</blockquote>
<p><img src="@source/blog/common/1.gif" alt=""></p>
<h2 id="_01-前言" tabindex="-1"><a class="header-anchor" href="#_01-前言" aria-hidden="true">#</a> 01 前言</h2>
<p>一般来说，习惯了大学的咸鱼生活之后你是不愿意去面对残酷的社会的，毕竟你认为自己还没有到出去找工作谋生的时候，当时我也是这么想的。每天睡到中午12点，睡醒就打开心爱的视频吃外卖...它不香吗？</p>
<p>没错，在经历了这样的生活过后，我居然觉得人生是那么一眼望不到头，<code v-pre>不是前途无限好而是前途无比迷茫，啥也看不到</code>。但是不得不承认的一点是，这样的生活很美好，没有任何的压力，没有任何的想法，毫不夸张的说你就是一具没有灵魂的肉体。所以，<code v-pre>我决心改变自己</code>！</p>
<p><img src="https://imgkr.cn-bj.ufileos.com/33cffb34-a56d-4c99-8b55-e211e053c328.png" alt=""></p>
<h2 id="_02-你经历过找实习的痛苦吗" tabindex="-1"><a class="header-anchor" href="#_02-你经历过找实习的痛苦吗" aria-hidden="true">#</a> 02 你经历过找实习的痛苦吗</h2>
<p>到了大三暑假，原本没有紧张的氛围一下子变得无比紧张，因为有同学找到大厂实习了。</p>
<p>对于别人找到实习的消息，我是一边的羡慕又嫉妒呀，想着自己本来是可以找到实习的。没错自己的入门是比很多人晚，我是<code v-pre>大三的时候</code>才开始真正学习一门技术，才开始真正的接触前端这个职业。虽然说很多人都没有方向，甚至不知道计算机的出路在哪的时候，我就开始了自己的想法，起码比他们有了一点经验，因为<code v-pre>我确定了自己的方向</code>。</p>
<p>那时候的自己基本上都是为了学习而学习，努力去达到一个入门的标准，跟着慕课上面写一些简单的demo级别的项目，想想那段往事真的是不堪入目呀。不过还好还好。</p>
<h3 id="开始写简历了" tabindex="-1"><a class="header-anchor" href="#开始写简历了" aria-hidden="true">#</a> 开始写简历了</h3>
<p>之前的那些经历不是让我最慌的，最慌的是写简历。
众所周知，计算机的专业是没有维修电脑的。但是我后来才知道的是，计算机专业学的东西原来在<code v-pre>企业中是不适用</code>的。怎么说呢？因为在写简历的阶段，我也找了很多种怎么写简历的方法、简历内容编写等等，然后我发现，自己的大学到底学了啥？为什么自己学的东西都跟我将来工作的差别这么大？小朋友，你是否有很多问号</p>
<p>没事，<code v-pre>大学生的学习效率是很高的</code>，举例来说你即使一个学期没有听课，前一晚上的努力学习你也不会挂科。所以我们就拿出大学学习的效率，认真准备了简历上面的内容，你要考啥我就复习啥，问你怕不怕？</p>
<h3 id="开始投简历了" tabindex="-1"><a class="header-anchor" href="#开始投简历了" aria-hidden="true">#</a> 开始投简历了</h3>
<p>如无意外，我们一定是准备好了再投递简历的，但是如无意外你是没有面试机会的。怎么说呢？大部分的同学都是在<code v-pre>准备面试的时候就直接投递简历了</code>，但那时自己却没有这种想法也没有这种胆量。想想自己是几斤几两还是知道的，况且自己没有面试过任何一家公司，想想那种空前的压力有多大。
经过同学给的建议是先<code v-pre>尝试一下那些小的公司试一下水</code>，不要一开始就找你想要进的公司。所以我就照做了，那时候自己的无知、年少和满腔热血，把小公司都去海投了一遍。令我非常惊讶的是：<code v-pre>竟然没有一家有面试机会</code>？</p>
<h3 id="开始自闭阶段了" tabindex="-1"><a class="header-anchor" href="#开始自闭阶段了" aria-hidden="true">#</a> 开始自闭阶段了</h3>
<p>想着自己的几个月的付出现在却没有回音，想想难免会觉得心酸，难过，伤心...</p>
<p>不过虽然自己有那么一段的时间是属于<code v-pre>自闭的状态</code>，不想和别人说关于工作的事情。但是自己每天都有一种紧张的心态，因为万一有一家打电话过来了呢？不过没有万一。</p>
<p>我从一开始就没有注意到自己的问题，遇事都会觉得是其他的原因。虽然我知道是我的原因，我就是不愿意承认。对于自己第一次认清自己狼狈的面貌是有点不愿意，毕竟没有喜欢认可自己的不足，也不喜欢承认自己的原因、缺点。经过多方的思想斗争，跟同学朋友聊了之后我就开始<code v-pre>慢慢接受自己的不足</code>了，决心从简历上面下手修改。</p>
<h3 id="开始自我怀疑了" tabindex="-1"><a class="header-anchor" href="#开始自我怀疑了" aria-hidden="true">#</a> 开始自我怀疑了</h3>
<p>果不其然，修改了简历之后，自己有了第一次的面试机会。那时候是师兄进行的内推的，投了简历之后想着找两天时间好好从头过一遍简历上面的内容，但是没想到不多3个小时就来了电话。我裂开了</p>
<p><img src="https://imgkr.cn-bj.ufileos.com/8445e891-1ba1-4761-9515-60998dbfc31a.png" alt=""></p>
<p>这个面试题我至今还保留，是自己的第一次面试。想想那时候的自己是多么紧张，我接到电话的那一瞬间整个人都僵住了，甚至连自我介绍都没有准备，直接开面。</p>
<p>顺便说一下，上面的面试题基本上没有答出来，甚至自己连cookie与session的区别都没有搞清楚，我真的是优秀。如无意外，稳挂的面试没什么可说的。</p>
<p>但是自己变得<code v-pre>更加怀疑</code>了，难道网上说的前端面试题都是骗人的吗？怎么都没有出现哪些常规的面试题，这不是为难我胖虎吗？一度<code v-pre>怀疑自己不适合搞技术</code>，不适合面试。自己跟很多的小伙伴一样，过度关注前端的题库，忘记了计算机基础的内容，其实上面的计算机组成原理在大学都学过，但是谁又会认真记下来呢？</p>
<h2 id="_03-开始小公司实习" tabindex="-1"><a class="header-anchor" href="#_03-开始小公司实习" aria-hidden="true">#</a> 03 开始小公司实习</h2>
<p>说来惭愧，自己那时候除了面试上面的这一家公司之外自己就没有其他机会了。
但是幸运的是，同学介绍我去了一家公司（没有面试直接进去），公司很小只有十几人左右，是团队老师的一个学生创立的公司，我就去那里实习了3个月。还好是这一次的实习，让我的简历上面有东西可写，不然自己可以断定自己是没有机会去面试其他的大公司的。</p>
<p><img src="https://imgkr.cn-bj.ufileos.com/1cd1a3f4-e27b-4741-94ce-44a9f4ccdf86.png" alt=""></p>
<h3 id="人生第一份工作" tabindex="-1"><a class="header-anchor" href="#人生第一份工作" aria-hidden="true">#</a> 人生第一份工作</h3>
<p>所以这是真正意义上的第一份工作，第一份从事技术类型的工作，紧张又期待。</p>
<p>虽然自己也知道<code v-pre>社会工作与学校生活不同</code>，但是有很多事情你是必须要考虑的。比如<code v-pre>租房</code>、<code v-pre>上班</code>和其他事情。很多时候，就像在学校的时候自己是完全不用考虑住房的问题的，但是出去外面的时候你就不得不面对这个问题，开始接受社会的毒打了。</p>
<ul>
<li>租房</li>
<li>独立生活</li>
<li>准时上下班</li>
<li>没有课间休息</li>
<li>中午不能躺床上</li>
<li>饭堂没有学校便宜</li>
<li>工资刚好能维持生活</li>
</ul>
<p>上面的这些问题都是你必须考虑到的，除此之外还是有很多事情不能如愿的，当你经历过实习的时候你就会更加向往学校的咸鱼生活。不过想想，实习就是这样的，舒服是留给死人的。正如那句话说的，<code v-pre>死于25，葬于75</code>。</p>
<h3 id="第一次感受工作" tabindex="-1"><a class="header-anchor" href="#第一次感受工作" aria-hidden="true">#</a> 第一次感受工作</h3>
<p>自己在学校学的东西基本上是没有用到工作当中去，第一个原因是这个公司的技术栈是比较老的，还是用着2015年前的技术，前期基本上是看公司文档学习，看源代码等慢慢熟悉公司的业务。</p>
<p>那时候自己就想着，以后自己的人生就是这样了吗？想想还是有一些不愿意的，毕竟跟自己想象中的不一样，我开始有一点害怕了，<code v-pre>开始变得急躁与焦虑</code>，感觉生活开始对我下手了，毫无还手之力的我只好默默承受着这一切。</p>
<ul>
<li>上班一天比上课一天劳累</li>
<li>周末比上班还累</li>
<li>没有娱乐生活</li>
<li>没有朋友交谈</li>
</ul>
<p>这些都是我在实习中遇到的困难、上班当中的真实感受。所以经历了3个月左右的实习，自己选择了离开。那时候其实还挺矛盾的，公司培养你这么久你却要离开，但是仔细想想还是有自己想法，觉得自己有更大的机会，<code v-pre>感谢当初自己的选择</code>。</p>
<h3 id="第一次工作感悟" tabindex="-1"><a class="header-anchor" href="#第一次工作感悟" aria-hidden="true">#</a> 第一次工作感悟</h3>
<p>工作都是为了公司服务，<code v-pre>能做东西才是最好的</code>。</p>
<p>在一开始的那段时间，显得尤为难熬。虽然看起来你整天都是无所事事，但是你却不知道要干嘛，没人会在你身边教你，因为别人比你还忙，自己只能靠着仅有的一点智商猜测这个功能到底是干嘛用的。这是真实的情况，那时候我和我一朋友就是在这种懵逼的状态下度过了一段的时间。佩服佩服。</p>
<ul>
<li>理论无用，动手才是王道</li>
<li>加班是必须的操作</li>
<li>真正能帮你的只有自己</li>
<li>要有自己思考，不要让别人喂你</li>
<li>要给自己信心坚持下去</li>
</ul>
<p>上面的一些是我在实习的时候总结出来的，<code v-pre>实习就是等于提前接触这个社会</code>，接触将来自己要面对的生活环境、工作环境等。我认为最后一点才是重要的，要给自己信心走下去，要<code v-pre>不断暗示自己可以</code>的，一个人要是内心垮掉了基本上就没有动力了。</p>
<p><img src="https://imgkr.cn-bj.ufileos.com/49d75235-7fd3-4274-b991-e87da564fdd9.png" alt=""></p>
<h2 id="_04-小结" tabindex="-1"><a class="header-anchor" href="#_04-小结" aria-hidden="true">#</a> 04 小结</h2>
<p>从实习到现在这么长的时间，经过不断的沉淀、开发业务、学习前端技术、阅读技术书籍等努力，如今自己也如愿拿到了大厂offer，<code v-pre>感谢一路上帮助过我的小伙伴</code>，也<code v-pre>感谢自己曾经不懈的努力</code>。最近几天自己没有去更新内容，一方面是毕业答辩与毕业论文的事情需要准备，一方面是自己没有怎么去学习新的内容，没有输入何来产出，说来实在愧疚。</p>
<p>不过自己也是想借着总结过去的经历来鞭策自己不断向前，记住自己以往坎坷的实习经历，想想也不算很糟糕的事情嘛。最近几个月以来自己也是一直在不断总结过去的技术、学习方法、学习经历等，不得不说，我也不相信自己能够坚持下来，也有这么多东西可以分享。接下来的日子也要<code v-pre>好好沉淀，心如止水</code>。</p>
<p>相信你们也可以的！</p>
<p><img src="@source/blog/common/2.gif" alt=""></p>
</div></template>
